IDEA Open Model
ResultClass.TypeUpdateResultClass Property
Compatible with IDEA StatiCa v 10.1
 Type of update RC. If TypeUpdateResultClass is Update, ListItem will be updated
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public TypeUpdateResultClass TypeUpdateResultClass { get; set; }
Public Property TypeUpdateResultClass As TypeUpdateResultClass
	Get
	Set
public:
property TypeUpdateResultClass TypeUpdateResultClass {
	TypeUpdateResultClass get ();
	void set (TypeUpdateResultClass value);
}
Property Value
Type: TypeUpdateResultClass
See Also
Reference
ResultClass Class
IdeaRS.OpenModel.Loading Namespace